In [2]:
import pandas as pd

import dependencies

In [3]:
path_input = dependencies.rootFolder / 'data' / 'raw'
path_output = dependencies.rootFolder / 'data' / 'processed'

In [228]:
df_camiones = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='A:C'
)

In [229]:
df_camiones

   VEHÍCULO   WILAYA modelo
0      CC53    Aaiun   VOLVO
1      CC54    Aaiun   VOLVO
2      CC55    Aaiun   VOLVO
3      CC56    Aaiun   VOLVO
4      CC57    Aaiun   VOLVO
..      ...      ...     ...
79    CR219    Smara     MAN
80    CR223    Smara     MAN
81    CR224    Smara     MAN
82    CR225  Bojador     MAN
83    CR226    Dajla     MAN

[84 rows x 3 columns]

In [111]:
df_wilayas = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='B'    
)

In [112]:
df_wilayas

     WILAYA
0     Aaiun
1     Aaiun
2     Aaiun
3     Aaiun
4     Aaiun
..      ...
79    Smara
80    Smara
81    Smara
82  Bojador
83    Dajla

[84 rows x 1 columns]

In [113]:
df_wilayas["WILAYA"] = df_wilayas["WILAYA"].str.capitalize()

In [114]:
df_wilayas = df_wilayas["WILAYA"].drop_duplicates()

In [115]:
df_wilayas = df_wilayas.replace(["Inst"],["Instituciones"])

In [242]:
df_wilayas = pd.DataFrame(df_wilayas.unique())

AttributeError: 'DataFrame' object has no attribute 'unique'

In [116]:
df_wilayas

0              Aaiun
14    Taller central
15            Auserd
20           Bojador
26             Smara
38     Instituciones
40             Dajla
58     Instituciones
62        Transporte
Name: WILAYA, dtype: object

In [117]:
df_wilayas2 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='B',
    skiprows=9   
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [118]:
df_wilayas2.dropna()

      wilaya
0    Bojador
1      Smara
2      Smara
3      Smara
4      Smara
..       ...
929    Aaiun
930    Aaiun
931    Aaiun
932    Dajla
933    Aaiun

[933 rows x 1 columns]

In [119]:
df_wilayas2.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [120]:
df_wilayas2 = df_wilayas2.drop_duplicates().dropna()

In [121]:
df_wilayas2["wilaya"] = df_wilayas2["wilaya"].str.capitalize()

In [122]:
df_wilayas2

             wilaya
0           Bojador
1             Smara
7             Aaiun
28           Auserd
48   Taller central
96            Dajla
103   Instituciones
137      Transporte
207   Instituciones

In [124]:
df_wilayas = pd.merge(df_wilayas, df_wilayas2, how="left", left_on="WILAYA", right_on="wilaya")

In [134]:
df_wilayas = df_wilayas.drop_duplicates()

In [138]:
df_wilayas.drop(['wilaya'], axis=1)

            WILAYA
0            Aaiun
1   Taller central
2           Auserd
3          Bojador
4            Smara
5    Instituciones
7            Dajla
10      Transporte

In [139]:
df_wilayas.to_csv(path_output / "Wilayas.csv")

In [231]:
df_tagnum = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='M:N',
    skiprows=19
)

In [232]:
df_tagnum

   Unnamed: 12  Unnamed: 13
0         CC53     559915.0
1         CC54     559916.0
2         CC55     559917.0
3         CC56     559918.0
4         CC57     559919.0
..         ...          ...
60         NaN          NaN
61         NaN          NaN
62         NaN          NaN
63         NaN          NaN
64         NaN          NaN

[65 rows x 2 columns]

In [233]:
df_tagnum.columns

Index(['Unnamed: 12', 'Unnamed: 13'], dtype='object')

In [234]:
df_camiones2 = pd.merge(df_camiones, df_tagnum, left_on="VEHÍCULO", right_on="Unnamed: 12")

In [235]:
df_camiones2

   VEHÍCULO  WILAYA    modelo  Unnamed: 12  Unnamed: 13
0      CC53   Aaiun      VOLVO        CC53     559915.0
1      CC54   Aaiun      VOLVO        CC54     559916.0
2      CC55   Aaiun      VOLVO        CC55     559917.0
3      CC56   Aaiun      VOLVO        CC56     559918.0
4      CC57   Aaiun      VOLVO        CC57     559919.0
..      ...     ...        ...         ...          ...
60     CC11  Auserd  Sinotruck        CC11     771482.0
61     CC12   Dajla  Sinotruck        CC12     771483.0
62    CR217   Aaiun        MAN       CR217     771484.0
63    CR218   Aaiun        MAN       CR218     771485.0
64    CR219   Smara        MAN       CR219     771486.0

[65 rows x 5 columns]

In [236]:
df_camiones = df_camiones2.drop(['Unnamed: 12'], axis=1)

In [237]:
df_camiones = df_camiones.rename(columns={'Unnamed: 13':'TAG Number'})

In [238]:
df_camiones['TAG Number'] = df_camiones['TAG Number'].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [239]:
df_camiones

   VEHÍCULO  WILAYA    modelo   TAG Number
0      CC53   Aaiun      VOLVO    559915.0
1      CC54   Aaiun      VOLVO    559916.0
2      CC55   Aaiun      VOLVO    559917.0
3      CC56   Aaiun      VOLVO    559918.0
4      CC57   Aaiun      VOLVO    559919.0
..      ...     ...        ...         ...
60     CC11  Auserd  Sinotruck    771482.0
61     CC12   Dajla  Sinotruck    771483.0
62    CR217   Aaiun        MAN    771484.0
63    CR218   Aaiun        MAN    771485.0
64    CR219   Smara        MAN    771486.0

[65 rows x 4 columns]

In [240]:
df_camiones.to_csv(path_output / "Camiones.csv")

In [81]:
df_mecanicos = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='F:I',
    skiprows=9
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [82]:
df_mecanicos.columns = ["mec1", "mec2", "mec3", "mec4"]

In [83]:
df_mecanicos

       mec1        mec2 mec3 mec4
0       dah         NaN  NaN  NaN
1     jatri  hasan chej  NaN  NaN
2     jatri  hasan chej  NaN  NaN
3     jatri  hasan chej  NaN  NaN
4     jatri  hasan chej  NaN  NaN
...     ...         ...  ...  ...
2977    NaN         NaN  NaN  NaN
2978    NaN         NaN  NaN  NaN
2979    NaN         NaN  NaN  NaN
2980    NaN         NaN  NaN  NaN
2981    NaN         NaN  NaN  NaN

[2982 rows x 4 columns]

In [84]:
df_mecanicos2 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='preventive BBDD',
    usecols='F:I',
    skiprows=5
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [85]:
df_mecanicos2.columns = ["mec1", "mec2", "mec3", "mec4"]

In [86]:
df_mecanicos2

       mec1 mec2 mec3 mec4
0    todos   NaN  NaN  NaN
1    todos   NaN  NaN  NaN
2    todos   NaN  NaN  NaN
3    todos   NaN  NaN  NaN
4    todos   NaN  NaN  NaN
..      ...  ...  ...  ...
679     NaN  NaN  NaN  NaN
680     NaN  NaN  NaN  NaN
681     NaN  NaN  NaN  NaN
682     NaN  NaN  NaN  NaN
683     NaN  NaN  NaN  NaN

[684 rows x 4 columns]

In [87]:
df_mecanicos = pd.concat([df_mecanicos, df_mecanicos2])

In [88]:
df_mecanicos = pd.concat([df_mecanicos["mec1"], df_mecanicos["mec2"], df_mecanicos["mec3"], df_mecanicos["mec4"]]).dropna()

In [89]:
df_mecanicos = df_mecanicos.str.lower()

In [90]:
df_mecanicos = pd.DataFrame(df_mecanicos.unique())

In [91]:
df_mecanicos.columns=["mecanicos"]

In [92]:
df_mecanicos

            mecanicos
0                 dah
1               jatri
2        ahmed andala
3        brahim salem
4        moh abdalahi
5           moh fadel
6                 ali
7              laulad
8           sidi alal
9               txapu
10            brahim
11        jefe taller
12      bal-lal hammu
13             sidati
14      mohamed lamin
15      jatri mohamed
16  ahmed salek andal
17    mec transporte
18   salek logistica
19     mohamed fadel
20              lamni
21              todos
22            mohamed
23              saleh
24               dah
25      baba lebisir
26   mohamed abdalahi
27         hasan chej
28          conductor
29             todos
30             chofer
31               ali
32         sidi alal
33           sid alal
34         dah abidin
35              salek
36             juanjo
37      moha abdalahi
38          salek ali
39   chaibata gailani
40               adah
41       jefe taller
42       mohmed lamin
43            bachir
44      moh abdalahi
45        salek ali

In [93]:
df_mecanicos3 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='I:K',
    skiprows=1
)

In [94]:
df_mecanicos3.dropna(subset=["Taller"])

                Nombre          Taller           Oficio
0                 dah         Boujdour         Mecánico
1                saleh        Boujdour  Asist. Mecánico
2        mohamed lamin           Aused  Asist. Mecánico
3         brahim salem           Aused         Mecánico
4        Bal-lal Hammu           Dajla         Mecánico
5   Ahmed Mohamed Lmin           Dajla  Asist. Mecánico
6    Ahmed salek Andal           Aaiun         Mecánico
7            Salek Ali           Aaiun  Asist. Mecánico
8            moh fadel  taller general              NaN
9                 Adah  taller general              NaN
10                 Ali  taller general              NaN
11    Mohamed Abdalahi  taller general              NaN
12              Laulad  taller general              NaN
13           Sidi Alal  taller general              NaN
14    Chaibata Gailani  taller general              NaN
15       Jatri Mohamed           Smara         Mecánico
16          hasan chej           Smara  Asist. Mecánico
17               todos  taller general              NaN
18     mec transporte      transporte          Mecánico
19           conductor          centro              NaN
20      mohamed fadel   taller general     jefe taller
21               txapu           attsf          tecnico
22              juanjo           attsf              NaN
23             bachir   taller general     jefe almacen
27       baba lebisir    intervencion               NaN

In [95]:
df_mecanicos3 = pd.merge(df_mecanicos, df_mecanicos3, how="left", left_on="mecanicos", right_on="Nombre")

In [96]:
df_mecanicos3

            mecanicos            Nombre          Taller           Oficio
0                 dah               NaN             NaN              NaN
1               jatri               NaN             NaN              NaN
2        ahmed andala               NaN             NaN              NaN
3        brahim salem      brahim salem           Aused         Mecánico
4        moh abdalahi               NaN             NaN              NaN
5           moh fadel         moh fadel  taller general              NaN
6                 ali               NaN             NaN              NaN
7              laulad               NaN             NaN              NaN
8           sidi alal               NaN             NaN              NaN
9               txapu             txapu           attsf          tecnico
10            brahim                NaN             NaN              NaN
11        jefe taller               NaN             NaN              NaN
12      bal-lal hammu               NaN             NaN              NaN
13             sidati               NaN             NaN              NaN
14      mohamed lamin     mohamed lamin           Aused  Asist. Mecánico
15      jatri mohamed               NaN             NaN              NaN
16  ahmed salek andal               NaN             NaN              NaN
17    mec transporte    mec transporte      transporte          Mecánico
18   salek logistica   salek logistica              NaN              NaN
19     mohamed fadel     mohamed fadel   taller general     jefe taller
20              lamni             lamni             NaN              NaN
21              todos             todos  taller general              NaN
22            mohamed           mohamed             NaN              NaN
23              saleh             saleh        Boujdour  Asist. Mecánico
24               dah               dah         Boujdour         Mecánico
25      baba lebisir      baba lebisir    intervencion               NaN
26   mohamed abdalahi               NaN             NaN              NaN
27         hasan chej        hasan chej           Smara  Asist. Mecánico
28          conductor         conductor          centro              NaN
29          conductor         conductor             NaN              NaN
30             todos                NaN             NaN              NaN
31             chofer               NaN             NaN              NaN
32               ali                NaN             NaN              NaN
33         sidi alal                NaN             NaN              NaN
34           sid alal               NaN             NaN              NaN
35         dah abidin               NaN             NaN              NaN
36              salek               NaN             NaN              NaN
37             juanjo            juanjo           attsf              NaN
38      moha abdalahi               NaN             NaN              NaN
39          salek ali               NaN             NaN              NaN
40   chaibata gailani               NaN             NaN              NaN
41               adah               NaN             NaN              NaN
42       jefe taller                NaN             NaN              NaN
43       mohmed lamin               NaN             NaN              NaN
44            bachir            bachir   taller general     jefe almacen
45      moh abdalahi                NaN             NaN              NaN
46        salek ali                 NaN             NaN              NaN

In [199]:
df_mecanicos = df_mecanicos3.drop(['Nombre'], axis=1)

In [200]:
df_mecanicos

            mecanicos          Taller           Oficio
0                 dah             NaN              NaN
1               jatri             NaN              NaN
2        ahmed andala             NaN              NaN
3        brahim salem           Aused         Mecánico
4        moh abdalahi             NaN              NaN
5           moh fadel  taller general              NaN
6                 ali             NaN              NaN
7              laulad             NaN              NaN
8           sidi alal             NaN              NaN
9               txapu           attsf          tecnico
10            brahim              NaN              NaN
11        jefe taller             NaN              NaN
12      bal-lal hammu             NaN              NaN
13             sidati             NaN              NaN
14      mohamed lamin           Aused  Asist. Mecánico
15      jatri mohamed             NaN              NaN
16  ahmed salek andal             NaN              NaN
17    mec transporte      transporte          Mecánico
18   salek logistica              NaN              NaN
19     mohamed fadel   taller general     jefe taller
20              lamni             NaN              NaN
21              todos  taller general              NaN
22            mohamed             NaN              NaN
23              saleh        Boujdour  Asist. Mecánico
24               dah         Boujdour         Mecánico
25      baba lebisir    intervencion               NaN
26   mohamed abdalahi             NaN              NaN
27         hasan chej           Smara  Asist. Mecánico
28          conductor          centro              NaN
29          conductor             NaN              NaN
30             todos              NaN              NaN
31             chofer             NaN              NaN
32               ali              NaN              NaN
33         sidi alal              NaN              NaN
34           sid alal             NaN              NaN
35         dah abidin             NaN              NaN
36              salek             NaN              NaN
37             juanjo           attsf              NaN
38      moha abdalahi             NaN              NaN
39          salek ali             NaN              NaN
40   chaibata gailani             NaN              NaN
41               adah             NaN              NaN
42       jefe taller              NaN              NaN
43       mohmed lamin             NaN              NaN
44            bachir   taller general     jefe almacen
45      moh abdalahi              NaN              NaN
46        salek ali               NaN              NaN

In [208]:
df_mecanicos.to_csv(path_output / "Mecanicos.csv")

In [191]:
df_averia = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='preventive BBDD',
    usecols='Q:AE',
    skiprows=4,
    nrows=1
)

In [192]:
df_averia

,Niveles,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Cambio Piezas,Unnamed: 25,Unnamed: 26,Unnamed: 27,Lavado y engrase,Unnamed: 29,Unnamed: 30
0,Aceite,Anticongelante,Embrague,H Direccion,Baterias,L Freno,A. caja,A/destil,Ruedas,Lamparas,D/tacgfo,S. lava,J. carroceria,Calcho,Grasa

In [193]:
df_averia = df_averia.transpose()

In [194]:
df_averia.columns = ["Averia"]

In [195]:
df_averia = df_averia["Averia"].tolist()

In [196]:
df_averia

['Aceite',
 'Anticongelante',
 'Embrague',
 'H Direccion',
 'Baterias',
 ' L Freno',
 'A. caja',
 'A/destil',
 'Ruedas',
 'Lamparas',
 'D/tacgfo',
 'S. lava',
 'J. carroceria',
 'Calcho',
 'Grasa']

In [197]:
df_averia = pd.DataFrame(df_averia, columns = ['Averia'])

In [198]:
df_averia

            Averia
0           Aceite
1   Anticongelante
2         Embrague
3      H Direccion
4         Baterias
5          L Freno
6          A. caja
7         A/destil
8           Ruedas
9         Lamparas
10        D/tacgfo
11         S. lava
12   J. carroceria
13          Calcho
14           Grasa

In [209]:
df_averia.to_csv(path_output / "Averia.csv")

In [203]:
df_taller = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='G:H',
    skiprows=48
)

In [204]:
df_taller.columns=["tipo taller", "taller"]

In [205]:
df_taller = df_taller.dropna()

In [206]:
df_taller

  tipo taller          taller
0          TR           Aaiun
1          TR           Smara
2          TR          Auserd
3          TR           Dajla
4          TR         Bojador
5         ATC   Instituciones
6         ATC  taller central

In [207]:
df_taller.to_csv(path_output / "Taller.csv")

In [147]:
df_tipomant = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='M',
    skiprows=1,
    nrows= 18
)

In [148]:
df_tipomant = df_tipomant.dropna()

In [149]:
df_tipomant

     Tipos mantto
0           Anual
1       Semestral
2         Mensual
3         Semanal
4  Cuatrimestral

In [150]:
df_tipomant2 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='preventive BBDD',
    usecols='D',
    skiprows=5
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [151]:
df_tipomant2 = df_tipomant2.dropna()

In [152]:
df_tipomant2

    Clase de Mantenimiento
0               semestral
1               semestral
2               semestral
3           Cuatrimestral
4           Cuatrimestral
..                     ...
489                Mensual
490                Mensual
491                Mensual
492                Mensual
493                Mensual

[494 rows x 1 columns]

In [44]:
df_tipomant2["Clase de Mantenimiento"] = df_tipomant2["Clase de Mantenimiento"].str.capitalize()

In [153]:
df_tipomant2

    Clase de Mantenimiento
0               semestral
1               semestral
2               semestral
3           Cuatrimestral
4           Cuatrimestral
..                     ...
489                Mensual
490                Mensual
491                Mensual
492                Mensual
493                Mensual

[494 rows x 1 columns]

In [154]:
df_tipomant2 = df_tipomant2["Clase de Mantenimiento"].drop_duplicates()

In [155]:
df_tipomant2

0          semestral
3      Cuatrimestral
7             mensual
54          Semestral
58            Mensual
102             Anual
329         semestral
Name: Clase de Mantenimiento, dtype: object

In [156]:
df_tipomant = pd.merge(df_tipomant, df_tipomant2, how="left", left_on="Tipos mantto", right_on="Clase de Mantenimiento")

In [157]:
df_tipomant

     Tipos mantto Clase de Mantenimiento
0           Anual                  Anual
1       Semestral              Semestral
2         Mensual                Mensual
3         Semanal                    NaN
4  Cuatrimestral          Cuatrimestral

In [158]:
df_tipomant = pd.concat([df_tipomant["Tipos mantto"], df_tipomant["Clase de Mantenimiento"]]).dropna()

In [159]:
df_tipomant

0             Anual
1         Semestral
2           Mensual
3           Semanal
4    Cuatrimestral
0             Anual
1         Semestral
2           Mensual
4    Cuatrimestral
dtype: object

In [160]:
df_tipomant = df_tipomant.unique().tolist()

In [161]:
df_tipomant

['Anual', 'Semestral', 'Mensual', 'Semanal', 'Cuatrimestral ']

In [162]:
df_tipomant = pd.DataFrame(df_tipomant, columns = ['Tipo mantenimiento'])

In [163]:
df_tipomant

  Tipo mantenimiento
0              Anual
1          Semestral
2            Mensual
3            Semanal
4     Cuatrimestral

In [201]:
df_tipomant.to_csv(path_output / "Tipomant.csv")